[{"title":"2024-12-29 23:24","content":"\n\n<p><strong>Roo-Cline</strong>  - a fork of Cline (prev. Claude Dev)</p>\n<p><a href=\"https://github.com/RooVetGit/Roo-Cline\">github</a> </p>\n\n<p>Added experimental features:</p>\n\n<p>Dragging images into chats</p>\n<p>Sound effects for feedback</p>\n<p>Quick copying of requests from history</p>\n<p>Includes the current time in the system request</p>\n<p>Uses a file system watcher for more reliable monitoring of file system changes</p>\n<p>Automatic MCP approval for each tool</p>\n<p>Enabling/disabling MCP servers</p>\n<p>Configurable delay after automatic recording to allow diagnostics to identify potential problems</p>\n<p>and others</p>\n\n<p>Works alongside the original Cline</p>","date":"2024-12-29T23:24:53","month":12},{"title":"2024-12-29 13:51","content":"\n\n<p>![Photo](2024-12-29-13-51-23.jpg)</p>\n\n<p><a href=\"https://www.reddit.com/r/ChatGPTCoding/comments/1gwnpqs/comment/lyaln1x/\">reddit</a> </p>\n\n<p>None of them (AI assistants) are perfect... they all have some drawbacks.</p>\n\n<p>For me <a href=\"https://codeium.com/windsurf\">Windsurf</a>  is the best and most reliable for editing <strong>multiple</strong>  files, no doubt. It just seems to understand the context better. But it needs some refinement and some features.</p>\n\n<p><a href=\"https://www.cursor.com/\">Cursor</a>  is the most thought out and has the best autocomplete. But their composer leaves much to be desired.</p>\n\n<p><a href=\"https://aider.chat/\">Aider</a>  has some really cool features, and in my opinion, has the best diff editing functionality.</p>\n\n<p><a href=\"https://github.com/cline/cline\">Cline</a>  is free (there is an option) and works quite well.</p>\n\n<p>[Continue.dev](Continue.dev)  is free and great for autocomplete through the free codestral FIM API.</p>","date":"2024-12-29T13:51:23","month":12},{"title":"2024-12-29 01:28","content":"\n\n<p><a href=\"https://www.youtube.com/watch?v=GAe1IQtHqVU\">Video</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/GAe1IQtHqVU/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> demonstrates <strong>Cursor Composer</strong>  Agent</p>\n\n<p>Composer in Cursor is a tool that allows AI to create entire applications according to instructions. It significantly speeds up development, automating the creation of files, code, commands in the terminal. This can be especially useful if you want to quickly create a prototype or avoid routine work.</p>\n\n<p>This cannot be used with your API key, you need to pay for Cursor Pro. <em>Some Cursor features (like Tab Completion, Apply from Chat, and Composer) require specialized models and won’t work with custom API keys</em></p>","date":"2024-12-29T01:28:19","month":12},{"title":"2024-12-26 13:28","content":"\n\n<p><strong>LLM from Google</strong>  can finally do something</p>\n\n<p>Now Gemini 2.0 Flash <strong>as an experiment</strong>  is free to use through Google AI Studio and API. It has a large context window - 2 million tokens (this is for input). 😲</p>\n\n<p><em>Models from Google can be connected via API in Cursor settings (tab \"Models\"), but auto-patching from chat disappears and requires the Pro version, in my opinion, this is stinginess.</em> </p>\n\n<p>And <a href=\"https://www.youtube.com/watch?v=0l4hoQlyslw\">in this video</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/0l4hoQlyslw/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> about how to use Gemini 2.0 Flash using the tools <a href=\"https://aider.chat/\">Aider</a>  (for terminal) and <a href=\"https://github.com/cline/cline\">Cline</a>  for VSC. 💻</p>\n\n<ul><li>demonstrates how to install and configure these tools. Talks about limitations through the API. ⚙️</li><li>notes that Gemini 2.0 Flash works very fast and has excellent function calling capabilities. ⚡️</li></ul>\n\n<p>On the Aider leaderboard, it is of course behind the top models, but you have to pay for them, and this is a Flash series model, i.e., simplified.</p>","date":"2024-12-26T13:28:58","month":12},{"title":"2024-12-25 13:48","content":"\n\n<p>![Photo](2024-12-25-13-48-13.jpg)</p>\n\n<p>Cursor cheats</p>\n\n<p><strong>@ Symbols:</strong> </p>\n\n<p>File reference: <code>@filename</code>  - allows you to refer to a specific file.</p>\n<p>Function reference: <code>@functionName</code>  - refers to a function in the code.</p>\n<p>Variable reference: <code>@variableName</code>  - refers to a variable.</p>\n\n<p>Codebase search: <code>@codebase</code>  query - searches the codebase.</p>\n<p>Web search: <code>@web</code>  query - performs a web search.</p>","date":"2024-12-25T13:48:13","month":12},{"title":"2024-12-25 00:40","content":"\n\n<p>![Photo](2024-12-25-00-40-41.jpg)</p>\n\n<p>An interesting opinion <a href=\"https://news.ycombinator.com/item?id=42492753\">here in the comment</a>:</p>\n\n<p><em>With the development of artificial intelligence in programming, the price of (simple) software is heading to zero! Sometimes, it is much faster to \"code\" the function or utility you need yourself than to look for something ready-made.</em> </p>\n\n<p>Previously, developing even a small program required significant effort and time. Now, with the help of AI-based tools, the process of creating your own software is becoming fast and simple.</p>\n\n<p>That is, until everything becomes AI and software disappears, there will be something transitional, and that is when those who know how will make their own programs, rather than use others'.</p>","date":"2024-12-25T00:40:41","month":12},{"title":"2024-12-19 00:13","content":"\n\n<p>![Photo](2024-12-19-00-13-56.jpg)</p>\n\n<p>Github sent me an email saying that Copilot has a free usage with the following limitations:</p>\n\n<p>2k code completions, 50 chat messages / month</p>","date":"2024-12-19T00:13:56","month":12},{"title":"2024-12-18 23:21","content":"\n\n<p>Chatbot Arena added WebDev Arena: <a href=\"https://web.lmarena.ai/\">web.lmarena.ai</a>  - AI battle of two models to find what generates the best UI</p>\n\n<p>Models: Claude 3.5 Sonnet (20241022), Gemini-Exp-1206, GPT-4o-2024-11-20, Gemini-2.0-Flash-Exp, Qwen2.5-Coder-32B-Instruct and Gemini-1.5-Pro-002.</p>","date":"2024-12-18T23:21:50","month":12},{"title":"2024-12-17 23:31","content":"\n\n<p>Examples of where and how to set project context for AI</p>\n<ul><li>VSC Copilot</li><li>Cursor .cursorrules</li><li>Windsurf .windsurfrules</li></ul>\n\n<p>Here we add the coding style, tech stack, and project structure + clarify for the model those moments where our generation system often makes mistakes - the less is written here, the better</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/aG-utUqVrb0\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>The author of the video would like it to work like memGPT, that is, chats themselves understand what needs to be added there</p>","date":"2024-12-17T23:31:52","month":12},{"title":"2024-12-17 00:12","content":"\n\n<p>![Photo](2024-12-17-00-12-03.jpg)</p>\n\n<p><strong>Windsurf</strong> <a href=\"https://codeium.com/windsurf\">https://codeium.com/windsurf</a> </p>\n\n<p>as a competitor to Cursor (at launch, it can also take settings from it). At the base, it's all the same VSC, so the interface does not need to be studied much.</p>\n\n<p>You need a codeium account, this is a minus. There are three models - for money GPT 4o and Claude 3.5 Sonnet, free Cascade Base (this is like Llama 3 70B). I'm looking for what will work on my API keys, and there is no such option here, unfortunately.</p>\n\n<p>It created an html calculator for me, but the \"=\" button is in the middle for some reason.</p>\n\n<p>The author of the <a href=\"https://www.youtube.com/watch?v=T323mpYjgbI\">video</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/T323mpYjgbI/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> draws an analogy with a 2015 car - \"Tartan Prancer\" (Honda from Albania) to illustrate that Windsurf creates the impression of a great tool, but in reality, it is unfinished. He compares it to colleagues at work who constantly redo everything. AI here constantly rewrites the code of many files, which makes you have to check everything constantly, and this is like starting from scratch.</p>","date":"2024-12-17T00:12:03","month":12},{"title":"2024-12-13 17:14","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/GhIm-Dk1pzk\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n<p><strong>Devin</strong>  is publicly available to everyone.</p>\n<p>500$ / month.</p>\n<p>Only through Slack.</p>","date":"2024-12-13T17:14:39","month":12},{"title":"2024-12-13 02:11","content":"\n\n<p>In the Gemini 2.0 Flash update, there are Jules and Colab Data Science Agent.</p>\n\n<p><a href=\"https://developers.googleblog.com/en/the-next-chapter-of-the-gemini-era-for-developers/\">url</a><strong>Jules</strong>  is an experimental AI-based agent that can perform code development tasks, including bug fixes, writing new features, and creating pull requests.</p>\n<p>[not yet available]</p>\n\n<p><strong>Colab Data Science Agent</strong>  is an assistant for data analysis. This tool is designed to automate data work. It helps to quickly get insights by creating working Colab notebooks based on requests.</p>","date":"2024-12-13T02:11:48","month":12},{"title":"2024-12-11 18:56","content":"\n\n<p>\"12 days\" of OpenAI — day 4</p>\n\n<p>Canvas in ChatGPT is now for everyone and has learned to execute Python code</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/qZ0ImE41pVs\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>Competitor function Anthropic’s Claude <strong>Artifacts</strong>  has long been able to even output React components, but lately, they have big problems with the load and they are disabling many things for free users</p>","date":"2024-12-11T18:56:12","month":12},{"title":"2024-12-07 13:29","content":"\n\n<p>![Photo](2024-12-07-13-29-06.jpg)</p>\n\n","date":"2024-12-07T13:29:06","month":12},{"title":"2024-12-06 18:57","content":"\n\n<p>![Photo](2024-12-06-18-57-01.jpg)</p>\n\n","date":"2024-12-06T18:57:01","month":12},{"title":"2024-11-25 18:44","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/1QaXyA3iwig\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>This video is about how AI programming is developing as a product. The author - Patrick Debois - demonstrates the new capabilities that have appeared in various IDEs and tools for developers thanks to AI. Instead of simple code completion, AI can now perform multi-file editing, select context, etc.</p>\n\n<p>Patrick also describes how developers can expand the context for AI by adding documentation, style guides, terminals, and other sources of information. This allows for more accurate and efficient results from AI.</p>\n\n<p>⚠️ The key point is that the role of the developer is changing - now more time is spent reviewing and evaluating what the AI has generated, instead of directly writing code.</p>\n\n<p>Patrick talks about mechanisms to facilitate this process, such as automatic change highlighting, step-by-step presentation of results, and feedback.</p>","date":"2024-11-25T18:44:34","month":11},{"title":"2024-11-20 12:50","content":"\n\n<p>![Photo](2024-11-20-12-50-41.jpg)</p>\n\n<p>The European company Mistral has released an update for <a href=\"https://chat.mistral.ai/chat\">its online chat</a>  le Chat to catch up with both OpenAI and Anthropic. Currently in the free beta stage.</p>\n\n<p>Now they also have an editor mode <strong>Canvas</strong>  - and if you select a piece of code in it, an inline query window appears.</p>\n\n<p>news announcement: <a href=\"https://mistral.ai/news/mistral-chat/\">https://mistral.ai/news/mistral-chat/</a></p>","date":"2024-11-20T12:50:41","month":11},{"title":"2024-11-17 00:58","content":"\n\n<p>In recent days, the model has been actively promoted on the internet for some reason <strong>Qwen 2.5 Coder</strong> </p>\n\n<p>For connoisseurs of perversions <a href=\"https://www.youtube.com/watch?v=Q_sy45XggeM\">here is a video</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/Q_sy45XggeM/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> that demonstrates how to effectively combine the AI code editor Cursor with a local Qwen 2.5 3b or 14b (or 32b if you have a MacBook with an M chip) by installing an LM Studio server with CORS settings and using Ngrok to provide access through a public domain.</p>","date":"2024-11-17T00:58:15","month":11},{"title":"2024-11-05 17:38","content":"\n\n<p><strong>⚙️</strong> [Bolt.new](Bolt.new)<strong>Fork by Cole Medin</strong> <a href=\"https://github.com/coleam00/bolt.new-any-llm\">github</a> </p>\n\n<p>a fork of the repository [Bolt.new](Bolt.new)  by StackBlitz (automatic creation of full-fledged web applications directly in the browser using Claude Sonnet 3.5), which allows using different LLM providers such as OpenRouter, Gemini, DeepSeek, Mistral and \"Open AI Like\" (for example, sambanova)</p>\n\n<p>Also added the ability to Docker containerize the application to simplify installation and publish projects directly to GitHub.</p>\n\n<p>next in line deploy to Vercel/Netlify and Voice prompting</p>","date":"2024-11-05T17:38:02","month":11},{"title":"2024-10-30 21:53","content":"\n\n<p>GitHub Copilot now provides model selection - developers can use models from Anthropic, Google, and OpenAI.</p>\n\n<p>Introduced GitHub Spark - a tool for creating applications in natural language.</p>\n\n<p>A number of improvements have been implemented in GitHub Copilot, Copilot Workspace, GitHub Models, and Copilot Autofix to create an even more integrated AI-driven environment for developers.</p>\n\n<p><em>According to GitHub Octoverse 2024, the number of developers in the world has grown dramatically, with Python overtaking JavaScript as the most popular language on GitHub, partly due to the growth of activity in the field of generative AI.</em> <a href=\"https://github.com/newsroom/press-releases/github-universe-2024\">https://github.com/newsroom/press-releases/github-universe-2024</a></p>","date":"2024-10-30T21:53:42","month":10},{"title":"2024-10-23 12:34","content":"\n\n<p><strong>Copilot Arena</strong> </p>\n\n<p>Copilot Arena is a free-to-use project for comparing artificial intelligence assistants (models) for code generation.</p>\n\n<p>Provides you for evaluation <em>paired</em>  autocompletions from different language models, including GPT-4o, Codestral, Llama-3.1, and others.</p>\n\n<p>The goal is to evaluate which ones provide the best assistance to the programmer.</p>\n\n<p><a href=\"https://github.com/lmarena/copilot-arena\">github</a> <a href=\"https://marketplace.visualstudio.com/items?itemName=copilot-arena.copilot-arena\">vsc</a></p>","date":"2024-10-23T12:34:31","month":10},{"title":"2024-10-23 02:47","content":"\n\n<p>🤖 Anthropic introduced new versions of the Claude 3.5 Sonnet and Claude 3.5 Haiku models, which significantly improved their performance.</p>\n\n<p>🖥 The biggest novelty is \"using the computer / Agentic Computer Use\" (beta) - the ability of Claude models to directly interact with the computer, open applications, perform tasks and <strong>create code</strong>.</p>\n\n<p>💻 Demonstrations show that models can find information, fill out forms, fix errors and even create websites <strong>on their own</strong>.</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/xwf4LKrCy9w\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n","date":"2024-10-23T02:47:47","month":10},{"title":"2024-10-05 13:05","content":"\n\n<p>We have a new interesting stage in the development of coding assistants. If earlier we started with tools like phind and other plugins integrated into Visual Studio Code (VSC) as a chat, now users have at least four main options:</p>\n\n<p>(1) from the category of such plugins, the first and main one is <strong>GitHub Copilot</strong>, which is a completely closed product of Microsoft + OpenaAI, very closely integrated with VSC. Everything has already been decided and configured for you</p>\n\n<p>(2) At the same time, little by little <strong>Cursor</strong>  gained popularity, which is now a stable and high-quality product. Although it initially supported the use of API keys and custom queries to interact with models, it has now shifted more to \"you pay, we configure\"</p>\n\n<p>(3) The next option is Canvas or Artifact, which are already built into the <strong>chats on the website</strong>, allowing you to interactively work with code and get hints in real time in the browser itself. For simple projects. There are similar online ides</p>\n\n<p>(4) And finally, \"copies\" of Cursor are starting to come out, for example <strong>PearAI</strong>, focused on a more transparent approach to interacting with models - through API keys and locally of our choice. These are no longer just VSC plugins. <em>Now I'm testing this program and it has enough bugs so far</em> </p>\n<p>So the field of AI coding continues to evolve, and users can choose among different products, depending on their needs and preferences.</p>","date":"2024-10-05T13:05:09","month":10},{"title":"2024-10-05 12:38","content":"\n\n<p>![Photo](2024-10-05-12-38-44.jpg)</p>\n\n<p>Review code in ChatGPT Canvas</p>\n\n<p>The main thing they did was finally respond to Claude artifacts (I used them quite often for code and did not want to return to the ChatGPT chat) - but here it only works in paid plans, and there in all.</p>","date":"2024-10-05T12:38:44","month":10},{"title":"2024-10-04 23:46","content":"\n\n<p><a href=\"https://openai.com/index/introducing-canvas/\">https://openai.com/index/introducing-canvas/</a> </p>\n\n<p>OpenAI announced a new ChatGPT feature for editing text or <strong>code</strong>  — Canvas. It allows you to move the chat to a separate panel and have an \"editor window\".</p>\n\n<p>For text, it's cool that it allows you to make edits from AI on the side, like comments in Word. For code, there is a similar \"Review code\" button. In general, the functionality for code (so far?) is very basic and, unfortunately, does not have the ability to run, as it is in Claude Artifacts. But for simple projects, it's better than it was.</p>\n\n<p>There is an interesting button for translating code into other programming languages, but the question remains who needs it (maybe if JS to TS). The add comments and logging buttons do not do this selectively, but almost on every line of code - this is bad.</p>","date":"2024-10-04T23:46:44","month":10},{"title":"2024-10-02 23:43","content":"\n\n<p>📎 [AIs talks about PearAI.mp3](2024-10-02-23-43-10.mp3)</p>\n\n<p>Generated in notebooklm</p>","date":"2024-10-02T23:43:10","month":10},{"title":"2024-10-02 19:27","content":"\n\n<p><a href=\"https://trypear.ai/\">https://trypear.ai/</a><strong>PearAI</strong>  called themselves open source Cursor - they forked VSCode (editor) and <a href=\"https://github.com/continuedev/continue\">Continue</a>  (AI programming assistant) - this caused a small quarrel with Continue over ownership and license type, which added PR to them (<a href=\"https://techcrunch.com/2024/09/30/y-combinator-is-being-criticized-after-it-backed-an-ai-startup-that-admits-it-basically-cloned-another-ai-startup/\">TechCrunch</a> )</p>\n\n<p>PS there was already an open source clone of Cursor <a href=\"https://voideditor.com/\">https://voideditor.com/</a></p>","date":"2024-10-02T19:27:27","month":10},{"title":"2024-09-21 00:54","content":"\n\n<p>in Cursor AI added o1-preview and o1-mini</p>\n\n<p>since 09/19 OpenAI models o1-preview and o1-mini are now also in github copilot</p>\n\n<p><a href=\"https://github.blog/news-insights/product-news/try-out-openai-o1-in-github-copilot-and-models/\">https://github.blog/news-insights/product-news/try-out-openai-o1-in-github-copilot-and-models/</a></p>","date":"2024-09-21T00:54:29","month":9},{"title":"2024-09-13 17:11","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/eHz-xLSs50o\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>The video compares the performance of two top AI models - OpenAI o1 and Anthropic Sonnet 3.5 - in creating a 3D game <strong>with physics</strong>  of car parking.</p>\n\n<p>🚗 Sonnet 3.5 failed the task, giving an uncontrollable car, while o1-preview was able to generate the basic functionality of the game. o1 made a controllable car with tire tracks with a 0-shot prompt. Websim made a real game out of this.</p>\n\n<p>⚠️ However, on complicating the task (make a 3d game in the browser), the o1 model also failed - the car did not move, demonstrating that the model <strong>has not yet reached the level of a human developer.</strong> </p>\n<p>🤖 Overall, the video shows that o1 is a more powerful model than Sonnet 3.5, but still has limitations and needs further improvement.</p>\n\n<p>Cool case - start the code with an expensive model, then finish with cheaper ones (from o1 to websim)</p>","date":"2024-09-13T17:11:06","month":9},{"title":"2024-09-13 13:34","content":"\n\n<p>In the near future, we expect programming cases with <strong>OpenAI o1</strong>  - I'm following. Many say that it will solve very complex tasks</p>\n\n<p>also wondering how much it will cost to generate projects after the test stage</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/50W4YeQdnSg\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n","date":"2024-09-13T13:34:42","month":9}]