[{"title":"2024-05-01 00:08","content":"\n\n<p>![Photo](2024-05-01-00-08-39.jpg)</p>\n\n<p>На скріншоті показано результати \"сліпого\" порівняння людьми двох варіантів конвертації дизайну в код: різноманітних доступних інструментів та живої людини </p>\n<p>[</p>\n<p>JACoB (Just Another Coding Bot)](https://www.jacb.ai/)  - схоже під впливом Devin зробленний ШІ асистент, який перетворює дизайни на робочий код 💻, розуміє репозиторій 📂 </p>\n\n<p>🔄 Інтегрується з GitHub репозиторіями та дизайнами Figma</p>\n<p>🤝 Розумний діалог з людиною через огляд та внесення змін до коду</p>\n<p>(буде) 🔓 Відкритий код для розширення функціоналу  </p>\n<p>👥 Пристосований до робочого процесу існуючої команди</p>\n\n<p>Цікаво, що, подібно до нової версії GitHub Copilot, вони прешочергово зосереджуються на визначенні людиною переліку <strong>завдань</strong>  для ШІ агента</p>\n\n<p><em>Перевірити не зміг, на мій GitHub акк пишуть \"Try signing in with a different account.\"</em></p>","date":"2024-05-01T00:08:39","month":5},{"title":"2024-04-30 23:48","content":"\n\n<p><a href=\"https://github.blog/2024-04-29-github-copilot-workspace/\">https://github.blog/2024-04-29-github-copilot-workspace/</a><strong>GitHub представляє Copilot Workspace у TechPreview - нове середовище розробки на базі ШІ</strong> </p>\n\n<p>GitHub Copilot Workspace - це оновлене середовище розробки, де програмісти можуть працювати з кодом звичайною мовою 💬. Система може допомогти розробникам від самого початку - планування завдання ✅, написання специфікацій 📄 та генерації коду 💻. </p>\n<p>Усе це можна відредагувати та доопрацювати ✏️.</p>\n\n<p>Середовище інтегроване з GitHub Issues 📥, Pull Requests 🔃 та репозиторіями 🗃. </p>\n\n<p>Розробники можуть запустити та протестувати код прямо в Copilot Workspace 🚀. Це дозволяє спростити і пришвидшити весь цикл розробки програмного забезпечення ⏱.</p>\n\n<p>Для професійних розробників Copilot Workspace дозволить більше зосередитися на системному мисленні 🧠 та відійти від рутинної роботи, яку можна автоматизувати ⚙️.</p>","date":"2024-04-30T23:48:27","month":4},{"title":"2024-04-25 21:07","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/eR855VNPjhk\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>У <strong>Groq</strong>  на їх ютуб каналі є демо проекта <a href=\"https://github.com/freuk/iter\">iter</a>  на моделі mixtral-8x7b-32768 у терміналі на nix-shell. Я не тестував - його підхід усе друкувати й мати мінімум контролю над генерацією.</p>\n\n<p>1:53 Зате є крута фішка команда <strong>reflextion</strong>  - коли у модель зайде 6 запитів з інструкією подумати над проблемою.</p>\n\n<p><em>Відео з 8 березня, а теперь ще є llama3-70b-8192 - але 8к проти 32к контекстне вікно.</em> </p>\n\n<p>Для VSCode у каталозі розширень я знайшов <a href=\"https://marketplace.visualstudio.com/items?itemName=Unclecode.groqopilot\">Groqopilot v0.0.81</a>, але зараз він скоріш не працює ніж працює.</p>","date":"2024-04-25T21:07:01","month":4},{"title":"2024-04-24 22:44","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/5poVsIeq3TM\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n<p><strong>Snapdragon</strong>  презентували чіпи X не для телефонів, а для комп'ютерів Windows. Крім звичайного та графічного ядра, в них буде також NPU (нейронне процесорне ядро). Вони обіцяють, що програми працюватимуть швидше, і великі мовні моделі (LLM) можна буде запускати локально та нативно без проблем.</p>\n\n<p>VSCode на 17:53 </p>\n<p>з <strong>Qualcomm AI Code Completion</strong> </p>\n<p>з llama-chat-v2-7b</p>","date":"2024-04-24T22:44:33","month":4},{"title":"2024-04-24 16:58","content":"\n\n<p><a href=\"https://ollama.com/library/phi3\">https://ollama.com/library/phi3</a><strong>У каталог ollama додали нову версію моделі від MS Phi-3 mini.</strong> </p>\n\n<p>Незважаючи на свій відносно невеликий розмір 3.8B, ця модель, за словами розробників, демонструє високу ефективність у роботі з логікою та математичними завданнями.</p>\n\n<p>Під час навчання моделей Phi було використано підхід, подібний до навчання дітей за допомогою \"підручників\" (“textbook-like”) з математики, логіки та <strong>програмування</strong>. Очікується, що такий метод покращить загальні результати моделі в цих сферах.</p>\n\n<p><em>Також перевагою нової моделі є версія з великим контекстним вікном -  128k токенів.</em></p>","date":"2024-04-24T16:58:22","month":4},{"title":"2024-04-24 13:26","content":"\n\n<p>З'явився новий гравець, який прагне конкурувати з OpenAI та Anthropic - компанія <a href=\"https://www.reka.ai/\">Reka AI</a>. </p>\n\n<p>Наразі вони мають три моделі:</p>\n<p><strong>🟧 Edge</strong>: легка модель з 7b параметрів.</p>\n<p><strong>🟧 Flash</strong>: швидка та потужна модель з 21b параметрів.</p>\n<p><strong>🟧 Core</strong>: найбільша та найпотужніша модель для складних завдань (розмір невідомий).</p>\n\n<p>На немультимодальних тестах з генерації коду з текстових інструкцій, схоже, Core  поступається GPT-4 та Claude-3-Opus.</p>","date":"2024-04-24T13:26:13","month":4},{"title":"2024-04-24 02:28","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/Smklr44N8QU\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>🆕 В останьому оновлені <a href=\"https://cursor.sh/\">Cursor</a>  покращіли Copilot++ та зробили розділ \"Допомога\" у вигляді теж чату з ШІ (зараз у бета).</p>\n\n<p>Цей відеоогляд показує, як Copilot++ може автоматично генерувати код на основі контексту поточного проекту. Демонструється процес створення інтерактивного графа вузлів у фреймворку Vue.js за допомогою вказівок та команд, наданих Copilot++.</p>\n\n<p>Головні особливості Copilot++, продемонстровані у відео:</p>\n\n<ol><li>Авто-доповнення коду на кількох <strong>рядках</strong>  одночасно.</li><li>Розуміння контексту проекту для надання відповідних пропозицій коду.</li><li>Можливість <strong>додавати</strong>  документацію як довідкові матеріали для AI.</li><li>Гнучке керування генерацією коду через текстові інструкції.</li></ol>\n\n<p>Відео наголошує на тому, що використання AI-асистентів, таких як Copilot++, дозволяє розробникам зосередитись на високорівневій логіці замість написання окремих рядків коду. Це може значно підвищити продуктивність та залишатись актуальним в умовах стрімкого розвитку технологій.</p>","date":"2024-04-24T02:28:17","month":4},{"title":"2024-04-19 14:30","content":"\n\n<p>Написав для вас :) </p>\n\n<p><a href=\"https://danvoronov.medium.com/%D1%88%D1%96-%D0%B2-%D1%80%D0%BE%D0%B7%D1%80%D0%BE%D0%B1%D1%86%D1%96-%D0%BF%D0%B7-%D0%BF%D0%BE%D1%82%D0%BE%D1%87%D0%BD%D0%B8%D0%B9-%D1%81%D1%82%D0%B0%D0%BD-%D1%82%D0%B0-%D0%BF%D0%B5%D1%80%D1%81%D0%BF%D0%B5%D0%BA%D1%82%D0%B8%D0%B2%D0%B8-e93fdbb1997c\">ШІ в розробці ПЗ: поточний стан та перспективи</a></p>","date":"2024-04-19T14:30:44","month":4},{"title":"2024-04-18 23:45","content":"\n\n<p>🥳 Llama 3 вийшла!</p>\n\n<p>Моделі були навчені на двох нещодавно анонсованих кластерах із спеціально побудованими 24K GPU на понад 15T токенів даних - навчальний набір даних у 7 разів більший, ніж той, що використовувався для Llama 2, </p>\n<p>включаючи <strong>у 4 рази більше коду</strong>. </p>\n\n<p><a href=\"https://llama.meta.com/llama3/\">https://llama.meta.com/llama3/</a> </p>\n\n<p>моделі розгорнуті й на LPU <a href=\"https://groq.com/\">https://groq.com/</a></p>","date":"2024-04-18T23:45:16","month":4},{"title":"2024-04-18 15:40","content":"\n\n<p>Тепер <a href=\"https://tabby.tabbyml.com/docs/models/\">до офіційного реєстру</a>  Tabby додані моделі серії CodeGemma (2b та 7b) та CodeQwen (7b) як для доповнення так й для чату.</p>","date":"2024-04-18T15:40:29","month":4},{"title":"2024-04-13 20:59","content":"\n\n<p>![Photo](2024-04-13-20-59-58.jpg)</p>\n\n<p>Набір <strong>відкритих</strong>  моделей від Google для написання коду <a href=\"https://ai.google.dev/gemma/docs/codegemma\">CodeGemma</a>  додали у <a href=\"https://ollama.com/library/codegemma:latest\">ollama</a>  (яку підтримує Cody) та catalog.ngc.nvidia <a href=\"https://catalog.ngc.nvidia.com/orgs/nvidia/teams/nemo/models/codegemma<em>7b</em>base\">7B</a>  та <a href=\"https://catalog.ngc.nvidia.com/orgs/nvidia/teams/nemo/models/codegemma<em>2b</em>base\">2B</a>  - жодних повноцінних оглядів та порівнянь я не знайшов, можливо, це нікому не цікаво. </p>\n\n<p>Також не знайшов у Google прямого зазначення, яким є розмір контекстного вікна цих моделей.</p>","date":"2024-04-13T20:59:58","month":4},{"title":"2024-04-12 00:12","content":"\n\n<p><strong>Claude 3 тепер доступний для всіх користувачів Cody</strong>  🚀</p>\n<p>( <a href=\"https://sourcegraph.com/blog/claude-3-now-available-in-cody?utm<em>medium=email&amp;utm</em>content=302270481&amp;utm<em>source=hs</em>email\">блог</a>  )</p>\n\n<p>Cody тепер підтримує нову сім'ю моделей Claude 3 від Anthropic, яка включає три моделі: Haiku (найшвидша), Opus (найрозумніша) та Sonnet (проміжна). </p>\n\n<p>Ці моделі демонструють покращення в генерації коду, здатності до швидкого пригадування інформації з великого контексту та інших важливих для Cody характеристиках.</p>\n\n<p>🆓 Для користувачів Cody Free модель<strong>Sonnet (4та у рейтингу LMSYS Chatbot Arena) тепер використовується за замовчуванням</strong>, замінивши Claude 2.0 (15та у рейтингу LMSYS Chatbot Arena).  </p>\n\n<p>Користувачі Cody <strong>Pro</strong>  можуть обирати між Haiku (8ма у рейтингу LMSYS Chatbot Arena), Sonnet і Opus (1ша у рейтингу LMSYS Chatbot Arena)</p>","date":"2024-04-12T00:12:50","month":4},{"title":"2024-04-11 21:47","content":"\n\n<p>Відео від VRSEN про представлення Devid - AI-інженера програмного забезпечення. У ньому автор демонструє свою відкриту реалізацію Devin, яка має три основні переваги: повний доступ до вихідного коду, тренування на реальних задачах кодування, а не тільки на Issue-ах GitHub, і це агентна система.</p>\n\n<p>Автор показує, як Devid створює веб-сайт з грою \"Гра життя\", модифікуючи HTML, CSS та JavaScript файли. Потім він демонструє, як імпортувати Devid та інших агентів у свій власний проект, використовуючи контейнери Docker. Автор також описує, як налаштувати агентів-планувальників, агентів-розробників та агентів-браузерів, щоб вони ефективно співпрацювали для виконання завдань.</p>\n\n<p>Врешті-решт, автор тестує цю агентну систему на завданні з бенчмаркінгу декількох API-інтерфейсів, показуючи, як агенти можуть знаходити <strong>документацію</strong>, виконувати код та надавати результати. </p>\n\n<p>Наразі все працює доволі посередньо, хоча він звинувачує у цьому OpenAI. Якщо документація має багато сторінок, виникають помилки. Також не згадується, скільки токенів спожили ці завдання, просто стверджується, що це ефективніше, ніж у Devin.</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/BEpDRj9H3zE\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n","date":"2024-04-11T21:47:06","month":4},{"title":"2024-04-11 21:19","content":"\n\n<p>![Photo](2024-04-11-21-19-35.jpg)</p>\n\n<p>На конференції <strong>Cloud Next</strong>  Google показали свого асистента для програмування (на слайді це був плагін VSCode) - основний акцент зробили на тому, що в Gemeni 1.5 таке контекстне вікно, якого немає у жодного конкурента - на 1М токенів.</p>\n\n<p>Gemini Code Assist доступний для тестування безкоштовно до 11 липня 2024 року.</p>","date":"2024-04-11T21:19:35","month":4},{"title":"2024-04-09 02:09","content":"\n\n<p>Відео \"Чому я більше не використовую Copilot\":</p>\n\n<p>    🧠 Якщо не практикувати навички, можна їх втратити. Використання Copilot вплинуло на мій спосіб написання коду, спонукаючи мене чекати на підказки ШІ, замість того, щоб використовувати власний мозок.</p>\n\n<p>    👨‍💻 Написання коду стало менш цікавим. Copilot позбавив мене можливості вчитись, бути креативним і вирішувати проблеми самостійно, що приносило мені задоволення.</p>\n\n<p>    🔍 Якість підказок Copilot була нестабільною - часто вони були застарілі або містили помилки. Доводилося перевіряти документацію, що знижувало ефективність.</p>\n\n<p>    🔒 Конфіденційність є великою проблемою. Кожного разу, коли я використовував Copilot, фрагменти мого коду відправлялись на віддалений сервер, що неприйнятно для мене як прихильника конфіденційності та самостійного хостингу.</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/Wap2tkgaT1Q\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n<p>( трохи клікбейт та тільки одна точка зору )</p>","date":"2024-04-09T02:09:40","month":4},{"title":"2024-04-06 10:08","content":"\n\n<p>![Photo](2024-04-06-10-08-30.jpg)</p>\n\n<p>У <a href=\"https://www.phind.com/\">Phind</a>  теперь є 5 (10 для юзерів) безкоштовних<strong>запитів на 70b</strong>  на день. Раніше така опція була для GPT-4. </p>\n\n<p>Також з'явилася вкладка під назвою 'задати питання щодо вашого коду', позначена як експериментальна, і немає можливості її протестувати на плані за $10, треба перейти на $20. </p>\n\n<p>Підозрюю, це повинно підключати репозиторій, але на сторінці опису платних планів поки немає жодних деталей.</p>","date":"2024-04-06T10:08:30","month":4},{"title":"2024-04-05 21:14","content":"\n\n<p>![Photo](2024-04-05-21-14-37.jpg)</p>\n\n<p>Знайшов стартап <a href=\"https://www.coze.com/\">Coze</a>  — значно розширенний клон функціоналу <strong>GPTs</strong>, де</p>\n\n<p>1) немає підв'язяки чату тільки під сайт OpenAI - доступ до боту можливий з Discord, Telegram, Slack (бізнес-боти), Facebook та Instagram Messenger, LINE (популярна в Азії), Reddit (боти для спеціалізованих спільнот), Cici, Lark.</p>\n\n<p>2) можливо обрати GPT 3.5, де ліміт 500 повідомлень/день</p>\n\n<p>3) <a href=\"https://www.coze.com/store/plugin\">каталог вже налаштованих plugins</a>  де є GitHub, StackOverFlow, Code Interpreter, <a href=\"https://www.coze.com/store/plugin/7329367912139997186?from=explore_card\">Data Analysis</a> </p>\n\n<p>4) режим мульті-агентів - поясненя у відео </p>\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/l00ZB2ZaVO0\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>⌨️ У <a href=\"https://www.coze.com/store/bot\">bot store</a>  я знайшов <a href=\"https://www.coze.com/store/bot/7332362537742368774?panel=1&amp;bid=MDQEENGG04PIlXcm7-Pk2tsfKnYEHtKSJKKhfh0M7ZjrGvYRCAnokBXsyKyP8POPcX3bTQQA&amp;share=1&amp;from=others\">Code Companion від icheQ</a>  - зараз 11.7K юзерів. Є до нього й доступ з телеграм <em>Мінус - це стартап зараз без фінансової моделі.</em><em>Доступ тільки з USA, телеграм бот відповів мені через 3 хвилини й в цілом дуже повільно все працює.</em><em>Ліміти</em><em>GPT-4 100-50 повідомлень/день.</em> </p>\n\n<p>чат хаос <a href=\"https://t.me/+m7bX9D4WjV4yMzgx\">https://t.me/+m7bX9D4WjV4yMzgx</a></p>","date":"2024-04-05T21:14:37","month":4},{"title":"2024-04-04 01:24","content":"\n\n<p>Google <a href=\"https://www.youtube.com/playlist?list=PLOU2XLYxmsIL8TxLOcsVI_hCq0c6cO-WQ\">виклали відео </a> з їх <strong>Gemma Developer Day 2024</strong>.</p>\n\n<p>Gemma це відкриті LLM, які можна використовувати локально.</p>","date":"2024-04-04T01:24:24","month":4},{"title":"2024-04-02 22:09","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/ZUzfPy8qq00\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n<p><a href=\"https://bito.ai/\">Bito</a>  найбільш схожий на Github Copilot продукт, але з обмеженим безкоштовним планом (100 доповнень на місяць, 20 повідомлень у чаті на день). </p>\n\n<p>🤖 Відео розповідає про нового Bito AI <a href=\"https://bito.ai/ai-code-review-agent/\">Code Review Agent</a>, який допомагає скоротити час на код-ревю на 50% та поліпшити якість коду (працює тільки у плані за $15/місяць, але є тріал). </p>\n\n<p>🔧 Агент інтегрується з GitHub та GitLab, автоматично виконує статичний аналіз коду, перевіряє на вразливості та надає детальні коментарі з рекомендаціями щодо покращення коду.</p>","date":"2024-04-02T22:09:17","month":4},{"title":"2024-04-02 02:39","content":"\n\n<p>У розділі чатів на <a href=\"https://chat.lmsys.org/?arena\">Chatbot Arena</a>  та у <a href=\"https://labs.perplexity.ai/\">Perplexity playground</a>  з'явилася <strong>dbrx-instruct</strong>  модель (<a href=\"https://github.com/databricks/dbrx\">github</a> ). Я провів низку тестів із генерації коду, і справді результати гідні. До того ж <strong>швидче ніж CodeLLaMA</strong> -70B.</p>\n\n<p><em>Розробник VSСode плагіну</em> <a href=\"https://docs.double.bot/models\">Double</a><em>додав до GPT-4 Turbo та Claude 3 (Opus) теж DBRX Instruct, хоча не дуже зрозуміло навіщо та ще й GPT-5 вейтліст відкрив.</em> </p>\n\n<p>Компанія DataBricks, відома своїми рішеннями для обробки та аналізу даних,  випустила одну з найпотужніших та найефективніших <strong>відкритих</strong>  LLM - DBRX.  На графіках, які опубліковані <a href=\"https://www.databricks.com/blog/introducing-dbrx-new-state-art-open-llm\">в пості з презентацією</a>  моделі, DBRX випереджає інші відкриті рішення в галузях математики та <strong>програмування</strong>.</p>\n\n<p>Ця <strong>MoE 16x12B</strong>  мультиекспертна модель (132 мільярди загальних параметрів - 36 мільярдів активних параметрів для обробки кожного токену), яка у багатьох завданнях перевершуює відкриту Grok-1 та закриту GPT-3.5 Turbo (але не Claude 3 Haiku). Контекстне вікно 32k, токенайзер як й у GPT-4. Knowledge cutoff - грудень 2023.</p>\n\n<p>Вони говорять, що за тестами перевершують CodeLLaMA-70B. Модель DBRX досить великого розміру, щоб не кожен міг її запустити, проте не настільки величезна, як Grok-1, яку зараз практично ніхто не зможе розгорнути у себе. Meta планує випустити Lllama 3 десь у липні.</p>\n\n<p>Чат ще є на <a href=\"https://huggingface.co/spaces/databricks/dbrx-instruct\">https://huggingface.co/spaces/databricks/dbrx-instruct</a> </p>\n<p>(5-shoot max)</p>","date":"2024-04-02T02:39:17","month":4},{"title":"2024-03-29 20:36","content":"\n\n<p>За 13 хв проф. Andrew Ng (в нього багато курсів про ШІ) демонструє на слайдах передові методи використання великих мовних моделей для покращення процесу розробки програмного забезпечення.</p>\n\n<p>Головні ідеї виступу:</p>\n\n<p>🧠 Агентні підходи в AI стають все більш популярними та ефективними. Це <strong>ітеративний</strong>  процес, де AI може вчитися, переглядати й покращувати свій результат.</p>\n\n<p>✍️ <strong>Рефлексія</strong>: AI агент може оцінити власний код/результат та допрацювати його. Це підвищує продуктивність.</p>\n\n<p>🤖 Мультиагентні системи: використання <strong>двох або більше агентів</strong>, як експерт-кодер та експерт-рецензент, значно покращує якість.</p>\n\n<p>🔧 Використання <strong>інструментів</strong>: підключення AI до різних інструментів (вебпошук, аналіз даних тощо) розширює її можливості.</p>\n\n<p>👷‍♂️ <strong>Планування</strong>: AI агенти можуть автономно планувати дії та змінювати план в разі збоїв, що вражає.</p>\n\n<p>🔀 <strong>Комбінація</strong>  всіх цих підходів відкриває нові можливості та покращує результати AI у порівнянні з простим ґенеруванням коду (є слайд з графіком, але з 40% вісь).</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/sal78ACtGTc\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n<p><em>Тобто агентні технології штучного інтелекту можливо є наступним кроком у галузі розробки програмного забезпечення.</em></p>","date":"2024-03-29T20:36:42","month":3},{"title":"2024-03-28 11:54","content":"\n\n<p>Stability AI представили, а на olllama додали до репозиторію <strong>instruct</strong>  варіант їх моделі генерації коду <strong>Stable Code</strong>. Модель має 3b розмір й якість генерації на очікуваному рівні </p>\n\n<p><a href=\"https://ollama.com/library/stable-code\">https://ollama.com/library/stable-code</a></p>","date":"2024-03-28T11:54:16","month":3},{"title":"2024-03-28 02:58","content":"\n\n<p>![Photo](2024-03-28-02-58-33.jpg)</p>\n\n<p>І я також додався до цього своєю мишкою 😉</p>\n\n<p>З моменту запуску проекту <a href=\"https://chat.lmsys.org/?arena\">Chatbot Arena</a>  модель <strong>GPT-4</strong>  завжди була на першому місці. (<a href=\"https://arstechnica.com/information-technology/2024/03/the-king-is-dead-claude-3-surpasses-gpt-4-on-chatbot-arena-for-the-first-time/\">новина</a> )</p>\n\n<p>Цікаво, якщо на початку модель GPT-3.5 викликала захоплення, то зараз у порівнянні з новими моделями вона виглядає дуже слабкою і видає слабкі результати. <em>Очікуємо найближчим часом якусь зміну від компанії OpenAI.</em></p>","date":"2024-03-28T02:58:33","month":3},{"title":"2024-03-25 17:46","content":"\n\n<p><a href=\"https://www.youtube.com/watch?v=f0TzppYWvUQ\">Відео порівняння</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/f0TzppYWvUQ/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> плагінів під VSCode локальної генерації коду - <a href=\"https://continue.dev/\">Continue</a>  чи <a href=\"https://marketplace.visualstudio.com/items?itemName=rjmacarthy.twinny\">Twinny</a>  </p>\n\n<p>Варіанти:</p>\n<p>  🤖 Continue: усе тільки через чат, відсутність автодоповнення коду</p>\n<p>  🦙 Llama Coder: автодоповнення коду, відсутність чат-інтерфейсу</p>\n<p>  🔍 Cody від Sourcegraph: цінова модель незрозуміла</p>\n\n<p>  👯‍♂️ <strong>Twinny</strong>: новий проєкт, який 🤝 поєднує функції Llama Coder та Continue - чат і автодоповнення коду.</p>\n\n<p><em>Для автодоповнення, щоб воно не підвисало, звичайно, потрібно брати меншу \"базову\" модель (1-3B) і потужніший комп'ютер.</em><em>Щоб працював чат треба ще підняти \"instruct\" модель</em>.</p>","date":"2024-03-25T17:46:13","month":3},{"title":"2024-03-24 15:59","content":"\n\n<p>Зробив <a href=\"https://youtu.be/xwjA6CyZy_o\">відеоогляд на Codeium </a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/xwjA6CyZy_o/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p><a href=\"https://codeium.com/\">https://codeium.com/</a> </p>\n\n<p>при порівнянні з Cursor та Phind не цікава система і тим паче незрозуміло звідки у неї стільки лайків</p>","date":"2024-03-24T15:59:41","month":3},{"title":"2024-03-22 18:09","content":"\n\n<p><a href=\"https://www.youtube.com/watch?v=UaCzXLuEE1Y\">У цьому відео</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/UaCzXLuEE1Y/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> наведено використання <a href=\"https://github.com/TabbyML/tabby\">Tabby</a>  як локальної заміни GitHub Copilot для автодоповнення коду та генерації функцій. Система буде працювати <strong>без інтернету. Код не залишає ваш комп'ютер.</strong> </p>\n\n<p>Використовується модель <strong>StarCoder-3B</strong>  у <strong>VSCode</strong>. Розглядається встановлення та налаштування Tabby через Docker на машині з GPU NVIDIA GeForce <strong>RTX 3070</strong>. </p>\n\n<p>    🛠 Встановлення та налаштування Tabby через Docker </p>\n<p>    ⚙️ Вибір моделі (StarCoder, CodeLlama, DeepseekCoder) </p>\n<p>    💡 Можливість запуску Tabby на машині з GPU або CPU - що треба встановити, щоб працювала CUDA</p>\n\n<p><em>Автор вважає, що Tabby зручніше використовувати, ніж сервер ollama.</em></p>","date":"2024-03-22T18:09:26","month":3},{"title":"2024-03-21 00:30","content":"\n\n<p>Автор розширення для VS Code <strong>Double</strong>  каже, що його мотивувало два роки спостереження за тим, як команда GitHub Copilot не виправляла <a href=\"https://docs.double.bot/copilot\">недоліки користувацького інтерфейсу</a>:</p>\n<ul><li>некоректне закриття дужок,</li><li>погані автодоповнення коментарів, </li><li>відсутність автоімпорту бібліотек,</li><li>неповноцінна робота багатокурсорного режиму,</li></ul>\n<p>та всі інші проблеми застарілої моделі GPT-3.5 (тому що використовується GPT-4 там, де система вирішить).</p>\n\n<p>В останній версії Double інтегрована <strong>модель Claude 3 Opus</strong>  від Anthropic, яка, згідно з деякими бенчмарками, перевершує GPT-4. <em>Окрім Opus, також присутня GPT-4 Turbo.</em> [Double.bot](Double.bot)  прийняли в акселератор Y Combinator. Безкоштовно доступно 50 запитів на будь-яку з цих моделей на місяць. Повноцінна підписка коштує 20$ (а GitHub Copilot зараз коштує 10$ без slash-команд, 19$ з ними).</p>\n\n<p><em>Розширення немає на</em> [open-vsx.org](open-vsx.org)<em>.</em> </p>\n<p>Для реєстрації треба ввести код з SMS - на мій український номер він так і не надійшов.</p>","date":"2024-03-21T00:30:06","month":3},{"title":"2024-03-20 02:29","content":"\n\n<p><a href=\"https://www.youtube.com/watch?v=bxU937z9GQE\">Відповідь людини, яка створює WebGPT</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/bxU937z9GQE/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> на те, що його круту систему створення коду не помічають, оскільки вона частина підписки ChatGPT Plus - він показує і можна поставити на паузу, щоб подивитися, як він робить веб-запити. </p>\n\n<p><em>У кінці кінців він зробить свою платформу, яка виглядатиме просто як чат.</em></p>","date":"2024-03-20T02:29:10","month":3},{"title":"2024-03-17 21:12","content":"\n\n<p>![Photo](2024-03-17-21-12-21.jpg)</p>\n\n","date":"2024-03-17T21:12:21","month":3},{"title":"2024-03-16 15:31","content":"\n\n<p>![Photo](2024-03-16-15-31-03.jpg)</p>\n\n<p><a href=\"https://www.codium.ai/products/alpha-codium\">AlphaCodium</a><strong>від CodiumAI</strong> </p>\n\n<p>CodiumAI, на відміну від інших систем штучного інтелекту для роботи з кодом, вибрали і зайняли вузьку <strong>нішу</strong>  - покращення якості коду (генерація тестів, аналіз безпеки та продуктивності).</p>\n\n<p>Тепер їх наступний крок - система AlphaCodium, яка може <em>автоматично</em>  перевіряти якість згенерованого коду. Тим самим це схоже як працюють GAN. Вона <a href=\"https://github.com/Codium-ai/AlphaCodium\">open-source</a>  на OpenAI API ключі, та вирішує проблеми сформульовані у <a href=\"https://huggingface.co/datasets/deepmind/code_contests\">CodeContest</a>  форматі JSON.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=AOqnJLBYon4\">відео пояснення</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/AOqnJLBYon4/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> / <a href=\"https://www.codium.ai/blog/alphacodium-state-of-the-art-code-generation-for-code-contests/\">блог пост</a> </p>\n<p>Від “Інженерії запитів” до \"Інженерії потоку\"</p>","date":"2024-03-16T15:31:03","month":3}]