[{"title":"2024-12-29 23:24","content":"\n\n<p><strong>Roo-Cline</strong>  - форк Cline (prev. Claude Dev)</p>\n<p><a href=\"https://github.com/RooVetGit/Roo-Cline\">github</a> </p>\n\n<p>Додані експериментальні функції:</p>\n\n<p>Перетягування зображень у чати</p>\n<p>Звукові ефекти для зворотного зв'язку</p>\n<p>Швидке копіювання запитів з історії</p>\n<p>Включає поточний час у системний запит</p>\n<p>Використовує спостерігач файлової системи для більш надійного спостереження за змінами файлової системи</p>\n<p>Автоматичне затвердження MCP для кожного інструменту</p>\n<p>Увімкнення/вимкнення серверів MCP</p>\n<p>Налаштовувальна затримка після автоматичного запису для дозволу діагностики виявляти потенційні проблеми</p>\n<p>та інш</p>\n\n<p>Працює поряд з оригінальним Cline</p>","date":"2024-12-29T23:24:53","month":12},{"title":"2024-12-29 13:51","content":"\n\n<p>![Photo](2024-12-29-13-51-23.jpg)</p>\n\n<p><a href=\"https://www.reddit.com/r/ChatGPTCoding/comments/1gwnpqs/comment/lyaln1x/\">reddit</a> </p>\n\n<p>Жоден з них (ШІ помічників) не є ідеальним... у всіх є певні недоліки.</p>\n\n<p>Для мене <a href=\"https://codeium.com/windsurf\">Windsurf</a>  є найкращим і найнадійнішим для редагування <strong>кількох</strong>  файлів, без сумніву. Здається, він просто краще розуміє контекст. Але йому потрібне доопрацювання та деякі функції.</p>\n\n<p><a href=\"https://www.cursor.com/\">Cursor</a>  найкраще продуманий та має найкраще автодоповнення. Але їхній composer залишає бажати кращого.</p>\n\n<p><a href=\"https://aider.chat/\">Aider</a>  має кілька справді крутих функцій, і, на мою думку, має найкращу функціональність diff редагування.</p>\n\n<p><a href=\"https://github.com/cline/cline\">Cline</a>  безкоштовний (є варіант) і працює доволі добре.</p>\n\n<p>[Continue.dev](Continue.dev)  безкоштовний і чудово підходить для автодоповнення через безкоштовний API codestral FIM.</p>","date":"2024-12-29T13:51:23","month":12},{"title":"2024-12-29 01:28","content":"\n\n<p><a href=\"https://www.youtube.com/watch?v=GAe1IQtHqVU\">Відео</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/GAe1IQtHqVU/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> демонструє <strong>Cursor Composer</strong>  Agent </p>\n\n<p>Композер у Cursor - це інструмент, що дозволяє ШІ створювати цілі застосунки за вказівками. Він значно пришвидшує розробку, автоматизуючи створення  файлів, коду, команд у терміналі. Це може бути особливо корисно, якщо ти хочеш швидко створити прототип або уникнути рутинної роботи.</p>\n\n<p>Це не можна використовувати зі своїм API ключем, треба платити за Cursor Pro. <em>Some Cursor features (like Tab Completion, Apply from Chat, and Composer) require specialized models and won’t work with custom API keys</em></p>","date":"2024-12-29T01:28:19","month":12},{"title":"2024-12-26 13:28","content":"\n\n<p><strong>LLM від Google</strong>  нарешті щось можут робити</p>\n\n<p>Зараз Gemini 2.0 Flash <strong>як експеремент</strong>  є безкоштовною для використання через Google AI Studio та API.  Має велике контекстне вікно - 2 мільйони токенів (це на віхд). 😲</p>\n\n<p><em>Моделі від Google можна підключити через API в налаштуваннях Cursor (вкладка \"Моделі\"), але автопатчінг з чату зникає і вимагає Pro-версії, як на мене, це жлобство.</em> </p>\n\n<p>А <a href=\"https://www.youtube.com/watch?v=0l4hoQlyslw\">у цьому відео</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/0l4hoQlyslw/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> про те, як використовувати Gemini 2.0 Flash за допомогою інструментів <a href=\"https://aider.chat/\">Aider</a>  (під термінал) та <a href=\"https://github.com/cline/cline\">Cline</a>  під VSC. 💻</p>\n\n<ul><li>демонструє, як встановити та налаштувати ці інструменти. Розповідає про обмеження через API. ⚙️</li><li>зазначає, що Gemini 2.0 Flash працює дуже швидко та має відмінні можливості виклику функцій. ⚡️</li></ul>\n\n<p>На лідерборді Aider вона звісно відстає від топ моделей, але за них треба платити та й це модель серії Flash тобто спрощенної.</p>","date":"2024-12-26T13:28:58","month":12},{"title":"2024-12-25 13:48","content":"\n\n<p>![Photo](2024-12-25-13-48-13.jpg)</p>\n\n<p>Курсор чітщіт</p>\n\n<p><strong>Символи @:</strong> </p>\n\n<p>Посилання на файл: <code>@filename</code>  - дає змогу посилатися на певний файл.</p>\n<p>Посилання на функцію: <code>@functionName</code>  - посилається на функцію в коді.</p>\n<p>Посилання на змінну: <code>@variableName</code>  - посилається на змінну.</p>\n\n<p>Пошук у кодовій базі: <code>@codebase</code>  query - шукає у кодовій базі.</p>\n<p>Пошук в інтернеті: <code>@web</code>  query - виконує пошук в інтернеті.</p>","date":"2024-12-25T13:48:13","month":12},{"title":"2024-12-25 00:40","content":"\n\n<p>![Photo](2024-12-25-00-40-41.jpg)</p>\n\n<p>Цікава думка <a href=\"https://news.ycombinator.com/item?id=42492753\">тут у коментарі</a>:</p>\n\n<p><em>З розвитком штучного інтелекту в програмуванні ціна на (просте) програмне забезпечення прямує до нуля! Іноді, набагато швидше самому \"накодити\" потрібну тобі функцію чи утиліту, ніж шукати щось готове.</em> </p>\n\n<p>Раніше розробка навіть невеликої програми вимагала значних зусиль і часу. Тепер же, з допомогою інструментів на базі ШІ процес створення власного софту стає швидким й простим. </p>\n\n<p>Тобто до того часу коли все стане ШІ, а софт зникне буде щось перехідне й це коли хто вміє буде робити собі свої программи, а не використовувати чужі.</p>","date":"2024-12-25T00:40:41","month":12},{"title":"2024-12-19 00:13","content":"\n\n<p>![Photo](2024-12-19-00-13-56.jpg)</p>\n\n<p>Github надіслав мені листа про те, що в Copilot з'явилося безкоштовне використання із такими обмеженнями:</p>\n\n<p>2к доповнень коду, 50 чат-повідомлень / місяць</p>","date":"2024-12-19T00:13:56","month":12},{"title":"2024-12-18 23:21","content":"\n\n<p>Chatbot Arena додала WebDev Arena: <a href=\"https://web.lmarena.ai/\">web.lmarena.ai</a>  - ШІ-битва по дві моделі, щоб знайти що генерує найкращий UI</p>\n\n<p>Моделі: Claude 3.5 Sonnet (20241022), Gemini-Exp-1206, GPT-4o-2024-11-20, Gemini-2.0-Flash-Exp, Qwen2.5-Coder-32B-Instruct та Gemini-1.5-Pro-002.</p>","date":"2024-12-18T23:21:50","month":12},{"title":"2024-12-17 23:31","content":"\n\n<p>Приклади, де й як задавати контекст проекту для ШІ</p>\n<ul><li>VSC Copilot</li><li>Cursor .cursorrules</li><li>Windsurf .windsurfrules</li></ul>\n\n<p>Сюди додаємо стиль коду, техстек, та структуру проекту + прояснюємо для моделі ті моменти, де у нас система генерації часто помиляєтся — чим меньш тут написано, тим краще</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/aG-utUqVrb0\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>Автор відео хотів б що це працювало як memGPT тобто чати самі розуміли що треба туда дописувати</p>","date":"2024-12-17T23:31:52","month":12},{"title":"2024-12-17 00:12","content":"\n\n<p>![Photo](2024-12-17-00-12-03.jpg)</p>\n\n<p><strong>Windsurf</strong> <a href=\"https://codeium.com/windsurf\">https://codeium.com/windsurf</a> </p>\n\n<p>як конкурент Cursor (при запуску ще й може з нього забрати налаштування). У базі це все той же VSC, тому інтерфейс сильно вивчати не треба.</p>\n\n<p>Треба акканут на codeium це мінус. Моделі три - за гроші GPT 4o та Claude 3.5 Sonnet, безкоштовно Cascade Base (це схоже Llama 3 70B). Я шукаю що буде працювати на моїх API-ключах, і тут немає такого варіанту, на жаль.</p>\n\n<p>Калькулятор html мені створило, але кнопка \"=\" чомусь в середіні.</p>\n\n<p>Автор <a href=\"https://www.youtube.com/watch?v=T323mpYjgbI\">відео</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/T323mpYjgbI/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> наводить аналогію з автомобілем 2015 року - \"Tartan Prancer\" (Honda з Албанії), щоб проілюструвати, що Windsurf створює враження чудового інструменту, але в реальності він недопрацьований. Він порівнює це з колегами на роботі, які постійно все переробляють. ШІ тут постійно переписує код багатьох файлів, через що доводиться перевіряти все постійно, а це схоже на початок спочатку.</p>","date":"2024-12-17T00:12:03","month":12},{"title":"2024-12-13 17:14","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/GhIm-Dk1pzk\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n<p><strong>Devin</strong>  вийшов публічно для всіх. </p>\n<p>500$ / місяць. </p>\n<p>Тільки через Slack.</p>","date":"2024-12-13T17:14:39","month":12},{"title":"2024-12-13 02:11","content":"\n\n<p>В оновленні Gemini 2.0 Flash є  Jules та Colab Data Science Agent.</p>\n\n<p><a href=\"https://developers.googleblog.com/en/the-next-chapter-of-the-gemini-era-for-developers/\">url</a><strong>Jules</strong>  — це експериментальний агент на основі штучного інтелекту, який може виконувати завдання з розробки коду, зокрема виправлення багів, написання нових функцій та створення pull-реквестів.</p>\n<p>[поки ще недоступний]</p>\n\n<p><strong>Colab Data Science Agent</strong>  — асистент для аналізу даних. Цей інструмент створений для автоматизації роботи з даними. Він допомагає швидко отримати інсайти, створюючи робочі Colab-ноутбуки на основі запитів.</p>","date":"2024-12-13T02:11:48","month":12},{"title":"2024-12-11 18:56","content":"\n\n<p>\"12 днів\" OpenAI — день 4</p>\n\n<p>Canvas у ChatGPT тепер для всіх та навчився виконувати Python код</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/qZ0ImE41pVs\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>Конкурента функція Anthropic’s Claude <strong>Artifacts</strong>  вже давно вмів навіть React компоненти виводити, але останім часом в них великі проблеми з наватаженням та вони вимикають багато чого для безкоштовних юзерів</p>","date":"2024-12-11T18:56:12","month":12},{"title":"2024-12-07 13:29","content":"\n\n<p>![Photo](2024-12-07-13-29-06.jpg)</p>\n\n","date":"2024-12-07T13:29:06","month":12},{"title":"2024-12-06 18:57","content":"\n\n<p>![Photo](2024-12-06-18-57-01.jpg)</p>\n\n","date":"2024-12-06T18:57:01","month":12},{"title":"2024-11-25 18:44","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/1QaXyA3iwig\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>Це відео розповідає про те, як розвивається AI-программування як продукт. Автор - Патрік Дебуа - демонструє нові можливості, які з'явилися в різних IDE та інструментах для розробників завдяки AI. Замість простого доповнення коду, зараз AI може виконувати багатофайлову правку, підбирати контекст, тощо.</p>\n\n<p>Патрік також описує, як розробники можуть розширювати контекст для AI, додаючи документацію, правила стильового оформлення, термінали та інші джерела інформації. Це дозволяє отримувати більш точні та ефективні результати від AI.</p>\n\n<p>⚠️ Ключовим моментом є те, що роль розробника змінюється - тепер більше часу витрачається на перегляд та оцінку того, що згенерував AI, замість безпосереднього написання коду. </p>\n\n<p>Патрік розповідає про механізми для полегшення цього процесу, такі як автоматичне виділення змін, покрокове представлення результатів та зворотній зв'язок.</p>","date":"2024-11-25T18:44:34","month":11},{"title":"2024-11-20 12:50","content":"\n\n<p>![Photo](2024-11-20-12-50-41.jpg)</p>\n\n<p>Європейська компанія Mistral випустила оновлення для <a href=\"https://chat.mistral.ai/chat\">свого онлайн чату</a>  le Chat, щоб наздогнати і OpenAI, і Anthropic. Зараз у безкоштовній бета стадії.</p>\n\n<p>Тепер у них теж є режим редактора <strong>Canvas</strong>  - а якщо у ньому виділити шматок коду, то з'являється inline вікно запиту. </p>\n\n<p>новина анонс: <a href=\"https://mistral.ai/news/mistral-chat/\">https://mistral.ai/news/mistral-chat/</a></p>","date":"2024-11-20T12:50:41","month":11},{"title":"2024-11-17 00:58","content":"\n\n<p>Останні дні активно чомусь просуваєтся в інтернетах модель <strong>Qwen 2.5 Coder</strong> </p>\n\n<p>Для поціновувачів збочень <a href=\"https://www.youtube.com/watch?v=Q_sy45XggeM\">ось відео</a> </p>\n\n<p><img src=\"https://img.youtube.com/vi/Q_sy45XggeM/mqdefault.jpg\" alt=\"YouTube Preview\" /></p>\n\n<p> яке демонструє, як ефективно поєднати AI-редактор коду Cursor з локальною Qwen 2.5 3b чи 14b (чи 32b якщо у вас макбук з M чіпом), встановивши сервер LM Studio  з CORS налаштуванням та використовуючи Ngrok для забезпечення доступу через публічний домен.</p>","date":"2024-11-17T00:58:15","month":11},{"title":"2024-11-05 17:38","content":"\n\n<p><strong>⚙️</strong> [Bolt.new](Bolt.new)<strong>Fork by Cole Medin</strong> <a href=\"https://github.com/coleam00/bolt.new-any-llm\">github</a> </p>\n\n<p>форк репозиторію [Bolt.new](Bolt.new)  by StackBlitz (автоматичне створення повноцінних веб-застосунків безпосередньо в браузері за допомогою Claude Sonnet 3.5), який дозволяє використовувати різні LLM провайдери як то OpenRouter, Gemini, DeepSeek, Mistral та \"Open AI Like\"  (це наприклад sambanova)</p>\n\n<p>Також додана можливість Docker контейнеризувати застосунок для спрощення установки та публікувати проекти безпосередньо на GitHub.</p>\n\n<p>на черзі деплой на Vercel/Netlify та Voice prompting</p>","date":"2024-11-05T17:38:02","month":11},{"title":"2024-10-30 21:53","content":"\n\n<p>GitHub Copilot тепер надає вибір моделі - розробники можуть використовувати моделі від Anthropic, Google та OpenAI.</p>\n\n<p>Представлено GitHub Spark - інструмент для створення додатків на природній мові.</p>\n\n<p>Впроваджено низку вдосконалень в GitHub Copilot, Copilot Workspace, GitHub Models та Copilot Autofix, щоб створити ще більш інтегроване AI-орієнтоване середовище для розробників.</p>\n\n<p><em>За даними GitHub Octoverse 2024, кількість розробників у світі різко зросла, при цьому мова Python обігнала JavaScript як найпопулярніша мова на GitHub, частково завдяки зростанню активності в галузі генеративного AI.</em> <a href=\"https://github.com/newsroom/press-releases/github-universe-2024\">https://github.com/newsroom/press-releases/github-universe-2024</a></p>","date":"2024-10-30T21:53:42","month":10},{"title":"2024-10-23 12:34","content":"\n\n<p><strong>Copilot Arena</strong> </p>\n\n<p>Copilot Arena - безкоштовний у використанні проект порівняння помічників штучного інтелекту (моделей) для генерації коду. </p>\n\n<p>Надає вам для оцінки <em>парні</em>  автозавершення від різних мовних моделей, серед яких GPT-4o, Codestral, Llama-3.1 та інші.</p>\n\n<p>Мета - оцінити, які надають найкращу допомогу програмісту.</p>\n\n<p><a href=\"https://github.com/lmarena/copilot-arena\">github</a> <a href=\"https://marketplace.visualstudio.com/items?itemName=copilot-arena.copilot-arena\">vsc</a></p>","date":"2024-10-23T12:34:31","month":10},{"title":"2024-10-23 02:47","content":"\n\n<p>🤖 Anthropic представили нові версії моделей Claude 3.5 Sonnet та Claude 3.5 Haiku, які значно покращили їхню продуктивність.</p>\n\n<p>🖥 Найбільшою новинкою є \"використання комп'ютера / Agentic Computer Use\" (бета) - можливість моделей Claude безпосередньо взаємодіяти з комп'ютером, відкривати програми, виконувати завдання і <strong>створювати код</strong>.</p>\n\n<p>💻 Демонстрації показують, що моделі можуть знаходити інформацію, заповнювати форми, виправляти помилки і навіть створювати веб-сайти <strong>самостійно</strong>.</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/xwf4LKrCy9w\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n","date":"2024-10-23T02:47:47","month":10},{"title":"2024-10-05 13:05","content":"\n\n<p>У нас новий цікавий етап розвитку помічників для кодингу. Якщо раніше ми починали з інструментів на кшталт phind та інших плагінів, інтегрованих у Visual Studio Code (VSC) як чат, то зараз користувачі мають щонайменше чотири основні варіанти:</p>\n\n<p>(1) з категорії таких плагінів першим та головним є <strong>GitHub Copilot</strong>, який повністю закритий продукт Microsoft + OpenaAI дуже тісно інтегрований з VSC. За вас уже все вирішили та налаштували</p>\n\n<p>(2) Водночас, потрохи популярності набрав <strong>Cursor</strong>  який зараз стабільний та якісний продукт. Хоча він спочатку підтримував використання API-ключів та кастомних запитів для взаємодії з моделями, тепер більш змістилися теж до того, що \"ви платите, ми налаштовуємо\"</p>\n\n<p>(3) Наступний варіант  — це Canvas або Artifact, які вже вбудовані в самі <strong>чати на сайті</strong>, дозволяючи інтерактивно працювати з кодом та отримувати підказки в реальному часі у самому браузері. Для простих проектів. Є схожі на них й онлайн ide</p>\n\n<p>(4) І нарешті, починають виходити \"копії\" Курсору наприклад <strong>PearAI</strong>, орієнтовані на більш прозорий підхід до взаємодії з моделями - через API-ключі та локальними на наш вибір. Це вже не просто плагіни VSC. <em>Зараз я тестую цю програму й в ній поки що багів достатньо</em> </p>\n<p>Тож сфера ШІ кодінгу продовжує еволюціонувати, і користувачі можуть обирати серед різних продуктів, залежно від своїх потреб та уподобань.</p>","date":"2024-10-05T13:05:09","month":10},{"title":"2024-10-05 12:38","content":"\n\n<p>![Photo](2024-10-05-12-38-44.jpg)</p>\n\n<p>Review code у ChatGPT Canvas</p>\n\n<p>Головне що вони зробили, це нарешті відповили на Claude артефакти (я їх доволі часто використовува для коду й вже не хотів повертатися у чат ChatGPT) - але тут поки працює тільки в платних планах, а там у всіх.</p>","date":"2024-10-05T12:38:44","month":10},{"title":"2024-10-04 23:46","content":"\n\n<p><a href=\"https://openai.com/index/introducing-canvas/\">https://openai.com/index/introducing-canvas/</a> </p>\n\n<p>OpenAI анонсували нову функцію ChatGPT для редагування тексту чи <strong>коду</strong>  — Canvas. Вона дозволяє переносити чат у окрему панель та мати \"вікно редактору\".</p>\n\n<p>Для тексту прикольно що дозволяет робити правки від ШІ збоку, подібно до коментарів у Word. Для коду схожа кнопка \"Review code\" . В цілому функціонал для коду (поки що?) дуже базовий і, на жаль, не має можливості запуску, як це є в Claude Artifacts. Але для простих проектів це краще ніж було.</p>\n\n<p>Є цікава кнопка для перекладу коду на інші мови програмування, проте залишається питання, кому вона потрібна (можливо якщо JS у TS). Кнопки додавання коментарів та логінгу не вибірково це роблять, а майже на кожний рядок коду - це погано.</p>","date":"2024-10-04T23:46:44","month":10},{"title":"2024-10-02 23:43","content":"\n\n<p>📎 [AIs talks about PearAI.mp3](2024-10-02-23-43-10.mp3)</p>\n\n<p>Сгенерував у notebooklm</p>","date":"2024-10-02T23:43:10","month":10},{"title":"2024-10-02 19:27","content":"\n\n<p><a href=\"https://trypear.ai/\">https://trypear.ai/</a><strong>PearAI</strong>  назвали себе open source Cursor - форкнули VSCode (редактор) та <a href=\"https://github.com/continuedev/continue\">Continue</a>  (ШІ помічник з програмування) - з цього сталась невиличка сварка з Continue за права власності та тип ліцензії що додало їм PR (<a href=\"https://techcrunch.com/2024/09/30/y-combinator-is-being-criticized-after-it-backed-an-ai-startup-that-admits-it-basically-cloned-another-ai-startup/\">TechCrunch</a> )</p>\n\n<p>PS уже був open source клон Курсору <a href=\"https://voideditor.com/\">https://voideditor.com/</a></p>","date":"2024-10-02T19:27:27","month":10},{"title":"2024-09-21 00:54","content":"\n\n<p>в Cursor AI додали o1-preview та o1-mini </p>\n\n<p>з 19/09 моделі OpenAI o1-preview та o1-mini тепер й у гітхаб копайлоті</p>\n\n<p><a href=\"https://github.blog/news-insights/product-news/try-out-openai-o1-in-github-copilot-and-models/\">https://github.blog/news-insights/product-news/try-out-openai-o1-in-github-copilot-and-models/</a></p>","date":"2024-09-21T00:54:29","month":9},{"title":"2024-09-13 17:11","content":"\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/eHz-xLSs50o\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n\n\n<p>Відеоролик порівнює продуктивність двох топ моделей ШІ - OpenAI o1 та Anthropic Sonnet 3.5 - у створенні 3D-гри <strong>з фізикою</strong> паркування автомобіля.</p>\n\n<p>🚗 Sonnet 3.5 не впорався із завданням видавши некеровану автівку, тоді як o1-preview змогла згенерувати базовий функціонал гри. o1 зробила керовану автівку зі слідами шин 0-шот промтом. Websim з цього зробив прям гру. </p>\n\n<p>⚠️ Однак, на ускладнення завдання (зроби 3d гру у браузері), модель o1 також зазнала невдачі - автівка не рухалась, демонструючи, що модель<strong>все ще не досягла рівня людського розробника.</strong> </p>\n<p>🤖 Загалом, відео показує, що o1 є більш потужною моделлю, ніж Sonnet 3.5, але все ще має обмеження і потребує подальшого вдосконалення.</p>\n\n<p>Крутий кейс - починати код дорогою моделью, потім вже дороблюючи більш дешевими (з o1 у websim)</p>","date":"2024-09-13T17:11:06","month":9},{"title":"2024-09-13 13:34","content":"\n\n<p>Найближчим часом очікуємо кейсів программуваня з <strong>OpenAI o1</strong>  - стежу. Багато говорять, що буде вирішувати дуже складні завдання</p>\n\n<p>також цікаво скільки буде коштувати геренація проектів після тестової стадії</p>\n\n\n<div style=\"text-align: center; margin: 20px 0;\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/50W4YeQdnSg\" title=\"YouTube video\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n","date":"2024-09-13T13:34:42","month":9}]